# pandas
used for basically data analysis such as data manipulation, data visualisation, building ML models
Panas Data Structures are..........Series(works as numpy array), Data Frame
Pandas is basically build on top of numpy array

# Pandas Series

In [ ]:
import pandas as pd

In [ ]:
#series() function works just like the np.array()
a = pd.Series([1,2,3,4,5])

In [ ]:
a

Here the 1st column represents as index & the 2nd column represents the value

In [ ]:
#If we want to check the type of "a"
type(a)

In [ ]:
a[2]

In [ ]:
a = pd.Series(['a','b','c'])

In [ ]:
a

N.B: In Series() function if we store there string then it represent as 'OBJECT'

In [ ]:
#If we want the date list 
a = pd.date_range(start = '01-01-2020', end = '07-05-2020')

In [ ]:
a

In [ ]:
type(a)

# Pandas DataFrame

In [ ]:
import numpy as np

In [ ]:
temp = np.random.randint(low = 20, high = 100, size = [20,]) #That means 20 to 100 random values of 20 size
name = np.random.choice(['Faysal', 'Borshon', 'Nadia', 'Nodi'], 20) #That means these names are coming randomly 20 times
value = np.random.choice(['75','77','2','100'], 20)

Now we will zip all the variables to a list for making the DataFrame properly

In [ ]:
#Data Frame with list
a = list(zip(temp, name, value))

In [ ]:
df = pd.DataFrame(data = a, columns = ['Temp', 'Name', 'Value'])

In [ ]:
df

In [ ]:
type(df)

In [ ]:
#Data Frame with dictionary
df = pd.DataFrame({'temp':temp, 'Name':name, 'value':value})

In [ ]:
df

In [ ]:
#for initial 5 values
df.head()

In [ ]:
#For last 5 values
df.tail()

In [ ]:
#Dimension of Data Frame
df.shape

In [ ]:
df.columns

In [ ]:
df.Name

In [ ]:
#Another way to show column and most used way
df['Name']

In [ ]:
#This will return all the statistics of temp column
df['temp'].describe()

In [ ]:
#To know all the information of Data Frame
df.info()

In [ ]:
df.values

In [ ]:
#Make any particular column to index
df.set_index('temp')

In [ ]:
df

In [ ]:
#For making the change permanently 

df.set_index('temp', inplace = True)

#inplace is by default False to make it permanently change I have to change inplace in True

In [ ]:
df

In [ ]:
#Sorting the temp index in descending order
df.sort_index(axis = 0, ascending = False)

In [ ]:
#For dropping any particular column
df.drop(['value'], axis = 1)

#Value is sitting by default in a column not in a row. For dropping the value column I need to change the axis in 1 as it is by default axis = 0

# Loc & iLOc

In [ ]:
#0th & 1st index value of DF
df.iloc[[0,1]]

In [ ]:
#1st index to 3rd index and 1st column values
df.iloc[1:3, 1]

In [ ]:
df

In [ ]:
#Playing with boolean
df.iloc[[True, True,False,True,True, True,False,True,True,False,True,True, True,False,True,True, False,True,True,False]]

In [ ]:
#Value of 0th row and all the colun values
df.iloc[0,:]

In [ ]:
#loc means value of the indexes
df.loc[92, :]

In [ ]:
#Multiple indexes
df.loc[[90,94,56]]

In [ ]:
#Values of particular row and all the columns
df.loc[[90,94], :]

In [ ]:
#Values of particular row and column range
df.loc[[90, 94], 'Name':'value']

In [ ]:
#Playing with boolean
df.loc[[True, True,False,True,True, True,False,True,True,False,True,True, True,False,True,True, False,True,True,False]]

In [ ]:
#Convert a series into integer
df['value'] = df.value.astype(int)

In [ ]:
df.loc[df.value > 50]

In [ ]:
#We can also use condition and logic
df.loc[(df.value > 50) | (df.value == 50)]

# Reading CSV

In [ ]:
df1 = pd.read_csv('weather_data.csv')

In [ ]:
df1

In [ ]:
#pip3 install openpyxl
df1.to_excel('df_xl.xlsx', sheet_name = 'weather_data')

In [ ]:
#pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [ ]:
df2

In [ ]:
df2.drop(['Unnamed: 0'], axis = 1, inplace = True)

In [ ]:
df2

In [ ]:
df2.to_csv('file_csv')

In [ ]:
df2.to_csv('file_noindex.csv', index = False)

In [ ]:
df2

# Merging & Concat

In [78]:
d1 = pd.DataFrame([['a',1], ['b',2]], columns = ['Column1', 'Number'])
d2 = pd.DataFrame([['c',3,'Pigeon'], ['d',4,'Cat']], columns = ['Letter', 'Number', 'Pets'])

In [79]:
d1

  Column1  Number
0       a       1
1       b       2

In [80]:
d2

  Letter  Number    Pets
0      c       3  Pigeon
1      d       4     Cat

In [81]:
#Row wise concate
pd.concat([d1,d2], axis = 0)

  Column1  Number Letter    Pets
0       a       1    NaN     NaN
1       b       2    NaN     NaN
0     NaN       3      c  Pigeon
1     NaN       4      d     Cat

In [82]:
# Maintain the index
pd.concat([d1,d2], axis = 0, ignore_index = True)

  Column1  Number Letter    Pets
0       a       1    NaN     NaN
1       b       2    NaN     NaN
2     NaN       3      c  Pigeon
3     NaN       4      d     Cat

In [83]:
#Column wise index
pd.concat([d1,d2], axis = 1)

  Column1  Number Letter  Number    Pets
0       a       1      c       3  Pigeon
1       b       2      d       4     Cat

In [84]:
d3 = pd.DataFrame({
    "City" : ["Demra", "Mirpur", "Tejgaon", "Dhanmondi"],
    "Temperature" : [32, 35, 31, 38]
})

In [85]:
d3

        City  Temperature
0      Demra           32
1     Mirpur           35
2    Tejgaon           31
3  Dhanmondi           38

In [86]:
d4 = pd.DataFrame({
    "City" : ["Motijheel", "Demra", "Dhanmondi"],
    "Humidity" : [68,65,75]
})

In [87]:
d4

        City  Humidity
0  Motijheel        68
1      Demra        65
2  Dhanmondi        75

In [88]:
df = pd.merge(d3, d4, on = ['City'])

In [89]:
df

        City  Temperature  Humidity
0      Demra           32        65
1  Dhanmondi           38        75

In [90]:
df = pd.merge(d3, d4, on = ['City'], how = 'outer')

In [91]:
df

        City  Temperature  Humidity
0      Demra         32.0      65.0
1     Mirpur         35.0       NaN
2    Tejgaon         31.0       NaN
3  Dhanmondi         38.0      75.0
4  Motijheel          NaN      68.0

In [92]:
df = pd.merge(d3, d4, on = ['City'], how = 'left')

In [93]:
df

        City  Temperature  Humidity
0      Demra           32      65.0
1     Mirpur           35       NaN
2    Tejgaon           31       NaN
3  Dhanmondi           38      75.0